/* eslint-disable max-len */
/* eslint-disable import/extensions */
/* eslint-disable import/no-unresolved */

import React from 'react';

function Disclaimer() {
  return (
    <>
      <h1>免責事項</h1>

      <h2>サービス・アプリについて</h2>
      <p>当サイトのサービス・アプリは十分に検証した上でご提供させていただいておりますが、その動作において信頼性、正確性、完全性について保証するものではありません。当サイト・サービス・アプリによって生じた直接的、また間接的トラブル、損失、損害については、当サイトは一切の責任を負いません。当サイトのサービス・アプリを利用する場合は、自己責任で行う必要があります。</p>

      <h2>当サイトの情報の正確性について</h2>
      <p>当サイトのコンテンツや情報において、可能な限り正確な情報を掲載するよう努めていますおりますが、その情報に関する信頼性、正確性、完全性について保証するものではありません。また、誤情報が入り込んだり、情報が古くなったりすることもあります。必ずしも正確性を保証するものではありません。また合法性や安全性なども保証しません。</p>
      <p>掲載された内容の誤り、および掲載された情報に基づいて行われたことによって生じた直接的、また間接的トラブル、損失、損害については、当サイトは一切の責任を負いません。</p>

      <h2>損害等の責任について</h2>
      <p>当サイトに掲載された内容・サービス・アプリ・その他全てのコンテンツによって生じた損害等の一切の責任を負いかねますので、ご了承ください。また当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任も負いません。当サイトの保守、火災、停電、その他の自然災害、ウィルスや第三者の妨害等行為による不可抗力によって、当サイトによるサービスが停止したことに起因して利用者に生じた損害についても、何ら責任を負うものではありません。当サイトを利用する場合は、自己責任で行う必要があります。</p>

      <h2>当サイトで掲載している画像の著作権や肖像権等について</h2>
      <p>当サイトで掲載している画像の著作権や肖像権等は、各権利所有者に帰属します。万が一問題がある場合は、お問い合わせよりご連絡いただけますよう宜しくお願い致します。</p>
    </>
  );
}

export default Disclaimer;
